/*
 * Создайте программу, выводящую на экран все четырехзначные числа последовательности 1000 1003 1006 1009...
 */
public class Page71task8 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		for (int i=1000; i <=9999; i=i+3){
			System.out.print(i + " ");
		}

	}

}
