/*
 * Создайте программу, которая будет генерировать и выводить на экран вещественное псевдослучайное число
 * из промежутка [-3;3)
 */
public class Page56task1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		System.out.println((Math.random()*6-3));

	}

}
