/*
 * Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75...
 */
public class Page71task10 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		int i = 90;

		while (i >= 0) {
			System.out.println(i);
			i = i - 5;
		}

	}

}
